title: Challenge 6 RunOnce Persistence
id: 710ab0ac-f47e-4343-bb3c-0627a38d295c
status: Experimental
description: lab
author: ranc1d
date:
modified:
logsource:
  product: windows
  service: sysmon
detection:
  selection:
   EventID: 1
   Image|endswith: '\reg.exe'
   CommandLine|contains:
    - 'reg add '
    - 'REG_SZ'
  condition: selection
fields:
falsepositives:
level: medium
tags:
  - attack.defense_evation
  - attack.T1218.005